package com.tu.a1207teamproject

import android.database.sqlite.SQLiteDatabase
import android.os.Bundle
import android.widget.TextView
import androidx.appcompat.app.AppCompatActivity


class MainActivity : AppCompatActivity() {
    val list = arrayListOf<Siheung>(
        Siheung("정왕동제4호체육공원", "자연명소", "경기 시흥시 동서로 287", "시흥갯골생태공원은 경기도 유일의 내만 갯골과 옛 염전의 정취를 느낄 수 있는 아름다운 곳으로, 시민들의 휴식장소로 사랑받고 있습니다. 봄에는 벚꽃길이 조성되고, 여름에는 다양한 체험과 함께 해수풀장을 운영하여 아이들에게 즐거운 놀이환경을 제공합니다. 가을에는 순천만 못지않은 갈대숲과 코스모스가 어우러져 장관을 이룹니다.", "37.3895.126.7808"),
        Siheung("은계호수공원", "문화시설 ", "경기 시흥시 은행동 601-150", "은계호수공원은 은행동 일대에 약 5만2,000평(17만444㎡)으로 조성된 공원으로, 시민들의 쉼터이자 각종 공연들이 개최되는 공공 문화공간으로 활용되고 있습니다. 다채로운 물줄기와 은은한 조명, 경관을 더해주는 연출분수부터 수변데크로 이어져있는 조망쉼터, 오난산과 어우러지는 자연경관까지 은계를 대표하는 호수공원으로 자리매김하고 있습니다.", "37.4454,126.8065"),
        Siheung("시흥프리미엄아울렛", "문화시설", "경기도 시흥시 서해안로 699 시흥프리미엄아울렛", "신세계사이먼이 여주와 파주, 부산에 이어 오픈하는 4호점으로 부지면적은 14만7000㎡, 영업면적 4만2000㎡에 이르는 규모의 쇼핑몰이다.아울렛을 기점으로 반경 10km 기준 170만명이 현재 거주하고 있다.", "37.3807, 126.7389"),
        Siheung("오이도", "관광지", "경기도 시흥시 정왕동", "낮에는 푸른 바다와 어우러진 오이도의 상징인 빨강등대가 한 폭의 그림 같고, 저녁에는 바다에 붉은 낙조가 물드는 장관을 볼 수 있습니 다. 이뿐 아니라, 오이도에는 우리나라 서해안 일대에 가장 큰 규모의 선사유 적지(국가사적 441호)가 있는데요, 서해안 갯벌지대의 신석기시대 해안 적응 과정을 한눈에 볼 수 있어, 아이들의 체험교육 현장으로도 좋습니다.", "37.3456,126.6874"),
        Siheung("시흥시중앙도서관", "문화시설", "경기도 시흥시 정왕대로 191", "경기도 시흥시 중앙도서관은 2002년 시흥시립도서관으로 개관하여 2007년 시흥시 중앙도서관으로 명칭을 변경했다. 주요 내부시설로는 문헌정보실, 어린이정보실, 노약자/장애인 열람실, 전시실, 디지털정보실, 열람실 등이 있습니다. 소장 자료로는 문학, 사회과학, 예술 분야를 포함한 일반도서 20만 5,249권을 보유하고 있습니다", "37.3483, 126.7356"),
        Siheung("월곶포구", "자연명소", "경기도 시흥시 월곶해안로 일대", "서해만이 줄 수 있는 특유의 여유로움과 편안함을 담고 있는 월곶포구는, 만조 전후 어선이 수시로 드나들어 갓 잡아온 신선한 자연산 횟감들을 맛볼 수 있는 즐거움이 가득한 곳입니다.", "37.389,126.7419"),
        Siheung("물왕호수", "자연명소", "경기도 시흥시 물왕동", "시흥시에서 가장 규모가 큰 호수로 시민들이 걷고 싶은 산책길이 조성되어 호수를 감싸는 수변데크를 따라 호수 가까이에서 수려한 자연환경을 감상할 수 있습니다.", "37.3827,126.8335"),
        Siheung("시흥시 연꽃테마파크", "자연명소", "경기도 시흥시 관곡지로 139", "시흥시에서는 관곡지가 갖는 상징성과 역사성을 기리기 위해 관곡지 주변과 갯골생태공원, 물왕ㅈ수지 주변 논에 연꽃테마파크를 조성해 운영", "37.4023, 126.8072"),
        Siheung("소래산산림욕장", "자연명소", "경기도 시흥시 신천동,대야동", "소래산은 해발 299.4m높이의 산으로 인근의 인천, 부천 시민들까지도 즐겨 찾을만큼 자연 경관이 빼어난 산입니다. 산림욕장 내에는 각종 체육시설, ‘독서의 숲’, 원목 로프를 이용한 ‘힘 기르는 숲’ 등의 공간이 마련 되어 있어 바쁜 일상에 지친 피로와 긴장을 풀어주는 상쾌한 휴식처로 많은 사랑을 받고 있습니다.", "37.3413, 126.7785"),
        Siheung("시흥 오이도 선사유적공원", "자연명소", "경기도 시흥시 정왕동 924-13", "오이도 선사유적공원은 다양한 선사문화 생활상을 엿볼 수 있는 선사체험마을과 움집 체험이 가능한 야영마을, 발굴터, 사냥터 등이 조성되어 있다. 더불어 신석기시대 오이도 패총의 중요성을 알려 주는 패총전시관, 오이도의 낙조를 감상할 수 있는 전망대, 산책하기 좋은 억새길 등 다양한 볼거리를 갖추고 있다.", "37.3429,126.6959"),
        Siheung("옥구공원", "자연명소", "경기도 시흥시 서해안로 277", "옥구도 일대에 조성된 옥구공원은 고향 동산, 무궁화 동산, 습지원과 연꽃단지 등으로 구성된 환경 친화적 공원입니다.고향동산에는 향토수목원, 민속생활도구 전시관, 통나무 교실 등이 있고, 무궁화 동산은 계류 연못, 무궁화 화단, 벽천폭포 등으로 이루어져 있습니다.", "37.3557,126.7128"),
        Siheung("시흥오이도박물관", "문화시설", "경기도 시흥시 오이도로 332", "오이도 유적을 보호하고 활용하기 위해 2018년 오이도 선사유적공원이, 2019년 시흥오이도박물관이 조성되었다. 공원에서는 신석기인들의 생생한 삶의 모습을 만날 수 있고, 박물관에서는 보다 가깝게 시흥의 출토 유물들을 이해하고 선사시대 생활문화를 체험할 수 있는 기회를 제공한다.", "37.3366, 126.6908"),
        Siheung("창조자연사박물관", "문화시설", "경기도 시흥시 두문로71번길 4 ", "창조자연사 박물관은 약 3,500평의 대지위에 수백여종의 꽃과 나무가 어우러진 도심속에 위치한 친환경적 자연교육의 장이며 휴식공간", "37.4336, 126.7861"),
        Siheung("온동물체험농장", "문화시설", "경기도 시흥시 다지골길 33-2", "집에서 키우던 가축이나 도심에서는 키우고 싶지만 키우기 쉽지 않았던 반려동물들을 언제든지 부담없 이 와서 만나볼 수 있다.", "37.4147, 126.7637"),
        Siheung("따요딸기감귤농장", "관광지", "경기도 시흥시 하상동 264", "천혜향, 딸기, 황금향 등을 따볼 수 있는 체험을 제공한다.", "37.3902, 126.8183"),
        Siheung("용도수목원", "관광지", "경기도 시흥시 밭뒤길 32 ", "100여종의 야생화 정원과 다양한 식물이 자라나는 식물원, 향긋한 풀내음이 느껴지는 허브마을, 아이들의 눈높이에 맞는 물놀이장과 아이들이 좋아하는 동물들이 있으며 사계절 즐길 수 있는 썰매장이 있어 아이들에게는 체험학습장이 되고 온 가족이 함께 부담없이 자연의 소중함을 알며 즐길 수 있는 아름다운 휴식처", "37.4192, 126.8264"),
        Siheung("거북섬", "관광지", "경기도 시흥시 정왕동 2726", "거북섬은 경기도 시흥시 시화 MTV(Multi Techno Valley)에 조성된 거북이 모양으로 생긴 인공섬이다. 시흥시에서는 거북섬 일원에 세계적인 해양레저 복합단지를 조성하여 지역관광산업 부흥을 도모하고 일자리 창출 등 지역경제 활성화에 기여하는 개발사업을 진행하고 있다. 현재 거북섬에는 세계 최대 규모의 아시아 최초 인공서핑장인 웨이브파크가 있고, 근처에 다양한 카페와 식당이 있어 여름 휴양지로 부상하고 있다.", "37.3208, 126.6792"),
        Siheung("관곡지", "자연명소", "경기도 시흥시 하중동 208", "이곳에서 피는 연꽃은 백련으로서 빛깔이 희고 꽃잎은 뾰족한 것이 특징이다.. 최근에는 관곡지 가까이에 약 3만 평에 이르는 연꽃농장이 들어서 많은 관광객들이 찾고 있다.\n", "37.4025,126.8048"),
        Siheung("계수밤농장", "문화시설", "경기도 시흥시 걔수동", "만 이천평에 약 2천 그루의 밤나무를 소유한 농장으로 품종별로 다양한 밤나무를 심어서 시기별로 다른 밤을 만날 수 있는 곳", "37.4418, 126.8183"),
        Siheung("배곧한울공원 해수체험장", "관광지", "경기도 시흥시 해송십리로 61", "아이들이랑 놀기 좋은 풀장으로 유아풀, 키즈풀 (90cm) 두 군데로 나뉘어져 있다.", "37.354, 126.7011"),
        Siheung("소래산산림욕장", "자연명소", "경기도 시흥시 소래산길 37", "소래산에 조성한 삼림욕장이다.  약 5km에 이르는 산책로 주변에 각종 체육시설과 지압로·쉼터가 있다.", "37.4512,126.7793"),
        Siheung("달월숲", "관광지", "경기도 시흥시 다월길 180", "자연과 함께 숨쉬는 생명의 숲, 아이들과의 추억을 만들기 위한 숲 처험과 놀이터, 숲과 가족의 문화가 어우러지는 시흥의 대표적인 녹샘쉬터로 당일치기 야외 힐링 피크닉, 캠프닉이 가능한 장", "37.38153959,126.74884376"),
        Siheung("시흥승마힐링체험장", "관광지", "경기도 시흥시 마전로 342 시흥승마힐링체험장", "말과 함께 교감하고, 반려동물과 함께하는 시간을 자라나는 아이 들에게 자연을 선물할 수 있다.", "37.3697988,126.7722087"),
        Siheung("파라다이브", "관광지", "경기도 시흥시 거북섬중앙로 1 1동 3층 파라다이브", "파라다이브는 해양레저스포츠 테마의 레저시설로 약 35M깊이의 국내 최대급 딥다이빙풀, 파라 다이브35 도심속 루프탑풀&인피니티풀, 파라루프 날씨걱정없이 실내에서 즐기는 실내서핑, 파 라서프 신기한 트릭&미디어아트관이 있습니다.", "37.3264, 126.6831"),
        Siheung("시흥 오이도 선사유적공원", "관광지", "경기도 시흥시 서해안로 113-27", "신석기시대의 유적지. 2002년 4월 1일 사적으로 지정되었다. 오이도 입구 너른 자리(약 8천㎡)에 분포하고 있으며, 서해안에서 규모가 가장 큰 패총(조개무지)이다. 출토된 유물이 다양하다.", "37.3427, 126.6955"),
        Siheung("소전미술관", "문화시설", "경기도 시흥시 소래산길 41 ", "본관 건물과 정원으로 이루어져 있으며 정원에 조각공원이 꾸며져 있다. 본관에는 한국적인 감정과 느낌을 다양하게 표현한 도자명품과 불화·한국화·서양화 등 미술품을 전시하고 있으며 전시실 외에 도서관이 있어, 1만 3천여 권에 이르는 미술관련 전문서적, 80여 종의 국내외 정기간행물, 학위논문 등을 비치하고 있다.", "37.4521, 126.7855"),
        Siheung("벅스월드 곤충 체험 농장", "문화시설", "경기도 시흥시 금이동 173", "다양한 곤충을 직접 만져보고 체험할 수 있다.", "37.3534, 126.7114"),
        Siheung("어린이안전체험관 KIDSEPIA", "문화시설", "경기도 시흥시 배곧4로 94-52", "시흥 어린이 안전체험관은 어린이 발달 수준에 맞추어 만든 안전 현장체험 교육장이다.", "37.466, 126.8022"),
        Siheung("시흥시농업기술센터천문관", "관광지", "경기도 시흥시 관곡지로 139", "농업기술센터 시흥천문관은 우주의 신비함과 경이로움을 체험하고 시민의 천문과학 지식 향상과 천문과학의 대중화에 기여함을 목적으로 한다.", "37.4008, 126.8084"),
        Siheung("시흥 오이도 선사유적공원 전망대", "자연명소", "경기도 시흥시 오이도로 97", "선사유적공원을 한 눈에 내려다 볼 수 있는 전망대이다.", "37.3475,126.6938"),
        Siheung("워너두 칠드런스 뮤지엄", "관광지", "경기도 시흥시 은계호수로 49 시흥센트럴돔그랑트리캐슬 B1층B077워너두칠드런스뮤지엄", "융합교육을 할 수 있는 미국형체험관", "37.446,126.8022"),
        Siheung("배곧생명공원", "자연명소", "경기도 시흥시 배곧2로 25", "배곧생명공원은 '생명을 품은 도시'를 지향하는 배곧 신도시에 조성된 생태 공원으로 배곧 마루, 스카이데크, 갈대 산책로, 공연장 등으로 구성되어 있다. 도란뜰이라는 가족 피크닉장이 마련되어 있어 가족 단위로 방문하기 좋다.", "37.3727,126.722"),
        Siheung("창조자연사박물관", "관광지", "경기도 시흥시 두문로71번길 4 창조자연사박물관", "창조자연사 박물관은 약 3,500평의 대지위에 수백여종의 꽃과 나무가 어우러진 도심속에 위치한 친환경적 자연교육의 장이며 휴식공간입니다.", "37.4337,126.7867"),
        Siheung("비둘기공원", "자연명소", "경기도 시흥시 은행동 551", "비둘기공원은 경기도 시흥시 은행동에 위치한 근린공원으로, 넓은 공간에 각종 체육시설과 야외무대, 장미원 등이 조성된 시흥시를 대표하는 시민공원이다", "37.4427,126.9072"),
        Siheung("산들공원", "자연명소", "경기도 시흥시 군자로466번길 20-1", "물놀이장등이 있는 공원으로 곳곳에 쉼터가 많아 시민들이 휴식을 취할 수 있다.", "37.3475,126.7807"),
        Siheung("정왕동제4호체육공원", "문화시설", "경기도 시흥시 함송로13번길 17 정왕동 4호 체육공원(관리사무소)", "족구장, 풋살장 등의 코트가 구비되어 있고 산책로를 따라 산책하기 좋다,", "37.3668,126.7326"),
        Siheung("웨이브파크", "문화시설", "경기도 시흥시 거북섬둘레길 42", "서핑, 다이빙을 즐길 수 있는 웨이브파크입니다. 일상 속 특별한 재미를 웨이브파크에서 느낄 수 있다.", "37.323,126.6818"),
        Siheung("다이나믹온 시흥플랑드르", "문화시설", "경기도 시흥시 장현능곡로 155 B동 3층 다이나믹온", "점핑클라이밍, 다이나믹클라이밍, 드롭온 등등 익스트림도 진짜 다이나믹하게 즐길 수 있다. 키즈존에는 트램펄린, 짚라인, 볼풀장, 터치슬라이드, 디지털축구 등등 놀거리가 다양하다.", "37.371,126.808"),
        Siheung("물왕숲캠핑파크", "관광지", "경기도 시흥시 동서로 706-88", "시흥시의 캠핑장으로 오솔길 산책을 시작으로 뒷산 등산까지 가능한 코스가 있다.관리동 안에 안내데스크, 매점 그리고 카페가 있으며 화장실, 탈의실, 셔워장, 개수대를 갖추고 있어 편하게 놀러오기 좋은 곳이다.", "37.3809,126.8273"),
        Siheung("성담스퀘어", "문화시설", "경기도 시흥시 정왕대로 210 성담스퀘어", "성담스퀘어는 우리집 거실처럼 즐겁고 편안하게 머무르고 함께 라이프스타일을 만들어 나아가는 커뮤니티센터를 표방하는 복합쇼핑몰입니다.", "37.3459,126.7369"),
        Siheung("솔내아트센터", "문화시설", "경기도 시흥시 호현로 42-8 3층, 4층 솔내아트센터", " 시흥 최초의 극장으로 2022년 솔내아트센터라는 새 이름의 복합문화공간으로써 주민들에게 다시 돌아왔습니다.", "37.4439,126.7856"),
        Siheung("오이도수산물직판장", "문화시설", "경기도 시흥시 오이도로 167", "다양한 수산물을 한 장소에서 구입하여 먹을 수 있는 공간입니다.", "37.3459,126.6882")





    )
    override fun onCreate(savedInstanceState: Bundle?) {
        super.onCreate(savedInstanceState)
        setContentView(R.layout.activity_main)

//        val shared = getSharedPreferences("file", 0)
////        shared.edit().remove("check").apply()
//        val db = TeamDatabase(this)
//        if (shared.getBoolean("check", true)) {
//            db.insert("a", "b", "b", "d", "b")
//            shared.edit().putBoolean("check", false).apply()
//        }

//        val result = db.getResult()
//        for (res in result) {
//            println(res.location)
//            println(res.category)
//        }
        val textview = findViewById<TextView>(R.id.text)
        for (res in list) {
            println(res.location)
            println(res.category)
            println(res.address)
            println(res.explanation)
            println(res.longitude)
//            textview.text = res.location
            res.location
        }
    }
}